IoTone/ProjectMagNET/reference-designs/MagNET_M5DialFiddlerCrab/M5_Hive_Camera/sdkconfig.defaults.m5cams3
# M5Stack Unit CamS3 (ESP32-S3, 8 MB flash, 8 MB OPI PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Console: native USB-serial-JTAG (no external adapter needed).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# PSRAM — ESP32-S3 typically ships with OPI (octal) PSRAM.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
